Python 3.9.13 (tags/v3.9.13:6de2ca5, May 17 2022, 16:36:42) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> "abcdefg" [0:3]
'abc'
>>> "abcdefg" [2:5]
'cde'
>>> "abcdefg" [5:2]
''
>>> "abcdefg" [1:15]
'bcdefg'
>>> "abcdefg" [15]
Traceback (most recent call last):
  File "<pyshell#4>", line 1, in <module>
    "abcdefg" [15]
IndexError: string index out of range
>>> 
================================ RESTART: Shell ================================
>>> "987654321" [-4:-1]
'432'
>>> "987654321" [-1:-4]
''
>>> "987654321" [-1:-1]
''
>>> 
================================ RESTART: Shell ================================
>>> "0123456789"[:4]
'0123'
>>> "0123456789"[2:]
'23456789'
>>> "0123456789"[:]
'0123456789'
>>> 
================================ RESTART: Shell ================================
>>> "987654321" [-4:-1]
'432'
>>> "987654321" [-4:3]
''
>>> "987654321" [-4:7]
'43'
>>> "987654321" [-4:0]
''
>>> 
================================ RESTART: Shell ================================
>>> a = '158.58'[0:3]
>>> b = '158.58'[4:]
>>> c = "Сумма покупки " + str(a) + " руб., скидка " + str(b) + " коп."
>>> print(c)
Сумма покупки 158 руб., скидка 58 коп.
>>> 